
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Состав производственного ресурса.
// 
// Параметры:
//  ПроизводственныйРесурс - СправочникСсылка.mega_ПроизводственныеРесурсы - Производственный ресурс
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Состав производственного ресурса
Функция СоставПроизводственногоРесурса(ПроизводственныйРесурс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	mega_ПроизводственныеРесурсыСостав.НомерСтроки,
		|	mega_ПроизводственныеРесурсыСостав.Время,
		|	mega_ПроизводственныеРесурсыСостав.Элемент
		|ИЗ
		|	Справочник.mega_ПроизводственныеРесурсы.Состав КАК mega_ПроизводственныеРесурсыСостав
		|ГДЕ
		|	mega_ПроизводственныеРесурсыСостав.Ссылка = &ПроизводственныйРесурс";
	
	Запрос.УстановитьПараметр("ПроизводственныйРесурс", ПроизводственныйРесурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Возврат ВыборкаДетальныеЗаписи;	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
