// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ПроизводственныйРесурс", ПроизводственныйРесурс) Тогда
		
		ПродукцияПроизводственногоРесурса.Параметры.УстановитьЗначениеПараметра(
			"ПроизводственныйРесурс", ПроизводственныйРесурс);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПродукцияПроизводственногоРесурса //<ИмяТаблицыФормы>

&НаКлиенте
Процедура ПродукцияПроизводственногоРесурсаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьОВыбореНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьНоменклатуру(Команда)
	
	ОповеститьОВыбореНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповеститьОВыбореНаКлиенте()
	ТекущиеДанные = Элементы.ПродукцияПроизводственногоРесурса.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Структура = Новый Структура();
		Структура.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
		Структура.Вставить("Спецификация", ТекущиеДанные.Спецификация);
		Структура.Вставить("ВидСтадииОбработки", ТекущиеДанные.ВидСтадииОбработки);
		ОповеститьОВыборе(Структура);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
