
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВыполнитьДвижение(Регистратор, ВыборкаИзРезультатаЗапроса)Экспорт
	ВыборкаИзРезультатаЗапроса.Сбросить();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	
	Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
		
		Движение = НаборЗаписей.Добавить();		
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаИзРезультатаЗапроса);		
		Движение.Количество = Справочники.mega_ЕдиницыИзмерения.ПеревестиИзЕдиницыВЕдиницу(
			ВыборкаИзРезультатаЗапроса.Количество, ВыборкаИзРезультатаЗапроса.ЕдиницаИзмерения, ВыборкаИзРезультатаЗапроса.ЕдиницаХранения);
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
	Возврат Истина;
КонецФункции

Функция ПолучитьОстаткиНоменклатуры(Номенклатура, ДатаСреза = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Если ДатаСреза = Неопределено Тогда

		Запрос.Текст = ПолучитьТекстЗапросаНоменклатура();
	Иначе
						
		Запрос.Текст = ПолучитьТекстЗапросаНоменклатураДатаСреза();
		Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	КонецЕсли;					
	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Возврат ВыборкаДетальныеЗаписи.Остаток;
	КонецЦикла;
	
	Возврат 0;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗапросаНоменклатура()
	
	Возврат 
		"ВЫБРАТЬ
		|	Остатки.Номенклатура,
		|	Остатки.КоличествоОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.mega_ПроизводственныеЗапасы.Остатки(, Номенклатура = &Номенклатура) КАК
		|		Остатки";
	
КонецФункции

Функция ПолучитьТекстЗапросаНоменклатураДатаСреза()
	
	Возврат 
		"ВЫБРАТЬ
		|	Остатки.Номенклатура,
		|	Остатки.КоличествоОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.mega_ПроизводственныеЗапасы.Остатки(&ДатаСреза, Номенклатура = &Номенклатура) КАК
		|		Остатки";
	
КонецФункции

#КонецОбласти

#КонецЕсли